testing_data/could_test_runs/bench_cloud_100.txt
100 records sent, 85.763293 records/sec (0.03 MB/sec), 625.63 ms avg latency, 1161.00 ms max latency, 620 ms 50th, 623 ms 95th, 1161 ms 99th, 1161 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 13694.333
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 1349.661
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 468.000
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 154.333