testing_data/could_test_runs/bench_cloud_1000.txt
1000 records sent, 834.028357 records/sec (0.32 MB/sec), 385.99 ms avg latency, 829.00 ms max latency, 387 ms 50th, 495 ms 95th, 497 ms 99th, 829 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 15791.769
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 13341.508
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 295.423
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 96.231