testing_data/could_test_runs/bench_cloud_100000.txt
100000 records sent, 999.300490 records/sec (0.38 MB/sec), 96.54 ms avg latency, 860.00 ms max latency, 91 ms 50th, 126 ms 95th, 245 ms 99th, 485 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 5724.642
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 417373.545
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 15.930
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 68.631