testing_data/could_test_runs/bench_cloud_2000.txt
2000 records sent, 954.653938 records/sec (0.36 MB/sec), 486.06 ms avg latency, 1140.00 ms max latency, 548 ms 50th, 817 ms 95th, 821 ms 99th, 828 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 13254.548
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 25947.557
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 341.597
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 84.403