testing_data/could_test_runs/bench_cloud_3000.txt
3000 records sent, 969.305331 records/sec (0.37 MB/sec), 202.05 ms avg latency, 832.00 ms max latency, 120 ms 50th, 488 ms 95th, 509 ms 99th, 510 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 8133.368
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 37941.141
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 69.289
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 77.178