testing_data/could_test_runs/bench_cloud_500.txt
500 records sent, 487.804878 records/sec (0.19 MB/sec), 391.02 ms avg latency, 813.00 ms max latency, 415 ms 50th, 485 ms 95th, 485 ms 99th, 813 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 15791.769
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 6709.775
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 270.538
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 121.308