testing_data/could_test_runs/bench_cloud_5000.txt
5000 records sent, 986.777186 records/sec (0.38 MB/sec), 158.35 ms avg latency, 823.00 ms max latency, 106 ms 50th, 466 ms 95th, 495 ms 99th, 510 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 6877.667
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 59834.728
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 42.757
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 72.540