testing_data/could_test_runs/bench_cloud_8000.txt
8000 records sent, 990.712074 records/sec (0.38 MB/sec), 139.80 ms avg latency, 847.00 ms max latency, 102 ms 50th, 440 ms 95th, 513 ms 99th, 519 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 6738.551
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 88167.143
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 34.473
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 74.724